neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32WBA.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32WBA

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_CHANNEL_LOCK(channel_index) if (NeonRTOS_LockObjLock(&DMA_Channel_Mutex[(channel_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_CHANNEL_UNLOCK(channel_index) if (NeonRTOS_LockObjUnlock(&DMA_Channel_Mutex[(channel_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static const hwDMA_Channel_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined (UART1_BASE) || defined(USART1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined (LPUART1_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
};

static const hwDMA_Channel_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(SPI1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined(SPI3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
};

static const hwDMA_Channel_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(I2C1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined(I2C3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (GPDMA1_BASE)
#if defined (GPDMA1_Channel0)
        case hwDMA_Channel_Index_0:
#endif
#if defined (GPDMA1_Channel1)
        case hwDMA_Channel_Index_1:
#endif
#if defined (GPDMA1_Channel2)
        case hwDMA_Channel_Index_2:
#endif
#if defined (GPDMA1_Channel3)
        case hwDMA_Channel_Index_3:
#endif
#if defined (GPDMA1_Channel4)
        case hwDMA_Channel_Index_4:
#endif
#if defined (GPDMA1_Channel5)
        case hwDMA_Channel_Index_5:
#endif
#if defined (GPDMA1_Channel6)
        case hwDMA_Channel_Index_6:
#endif
#if defined (GPDMA1_Channel7)
        case hwDMA_Channel_Index_7:
#endif
                return GPDMA1;
#endif //GPDMA1_BASE
        default:
                break;
    }
    return NULL;
}

DMA_Channel_TypeDef * DMA_Map_Soc_Channel_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (GPDMA1_BASE)
#if defined (GPDMA1_Channel0)
        case hwDMA_Channel_Index_0: return GPDMA1_Channel0;
#endif
#if defined (GPDMA1_Channel1)
        case hwDMA_Channel_Index_1: return GPDMA1_Channel1;
#endif
#if defined (GPDMA1_Channel2)
        case hwDMA_Channel_Index_2: return GPDMA1_Channel2;
#endif
#if defined (GPDMA1_Channel3)
        case hwDMA_Channel_Index_3: return GPDMA1_Channel3;
#endif
#if defined (GPDMA1_Channel4)
        case hwDMA_Channel_Index_4: return GPDMA1_Channel4;
#endif
#if defined (GPDMA1_Channel5)
        case hwDMA_Channel_Index_5: return GPDMA1_Channel5;
#endif
#if defined (GPDMA1_Channel6)
        case hwDMA_Channel_Index_6: return GPDMA1_Channel6;
#endif
#if defined (GPDMA1_Channel7)
        case hwDMA_Channel_Index_7: return GPDMA1_Channel7;
#endif
#endif
        default: break;
    }
    return NULL;
}

static void DMA_IRQ_Handler(hwDMA_Channel_Index index)
{
        if(index>=hwDMA_Channel_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
void GPDMA1_Channel0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_0); }
#endif
#if defined(GPDMA1_Channel1)
void GPDMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined(GPDMA1_Channel2)
void GPDMA1_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_2); }
#endif
#if defined(GPDMA1_Channel3)
void GPDMA1_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_3); }
#endif
#if defined(GPDMA1_Channel4)
void GPDMA1_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_4); }
#endif
#if defined(GPDMA1_Channel5)
void GPDMA1_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_5); }
#endif
#if defined(GPDMA1_Channel6)
void GPDMA1_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_6); }
#endif
#if defined(GPDMA1_Channel7)
void GPDMA1_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_7); }
#endif
#endif // GPDMA1_BASE

void DMA_Clock_Enable()
{
#if defined (GPDMA1_BASE)
         __HAL_RCC_GPDMA1_CLK_ENABLE();
#endif //GPDMA1_BASE
}

void DMA_Clock_Disable()
{
#if defined (GPDMA1_BASE)
        __HAL_RCC_GPDMA1_CLK_DISABLE();
#endif //GPDMA1_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Channel_Init_Status[channel_index]==true)
        {
                return hwDMA_OK;
        }

        switch(channel_index)
        {
#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
                case hwDMA_Channel_Index_0:
                        HAL_NVIC_SetPriority(GPDMA1_Channel0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel0_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_SetPriority(GPDMA1_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel2_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_SetPriority(GPDMA1_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel3_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_SetPriority(GPDMA1_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel4_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_SetPriority(GPDMA1_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel5_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_SetPriority(GPDMA1_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel6_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_SetPriority(GPDMA1_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel7_IRQn);
                        break;
#endif
#endif // GPDMA1_BASE
        }

